## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| recreate | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s must be replaced
-/+ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ca-central-1:296255494825:nodegroup/notification-canada-ca-production-eks-cluster/notification-canada-ca-production-eks-primary-node-group-k8s/26cb622a-61e4-c21a-2e98-7cdf170c9472" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          ~ "r5.large" -> "c7i.xlarge",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-notification-canada-ca-production-eks-primary-node-group-k8s-26cb622a-61e4-c21a-2e98-7cdf170c9472"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
      ~ version                = "1.32" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0982c75ef73673e77"
          ~ name    = "notification-canada-ca-production-eks-node-group" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ node_repair_config {
          + ami_type               = (known after apply)
          + arn                    = (known after apply)
          + capacity_type          = (known after apply)
          + cluster_name           = (known after apply)
          + disk_size              = (known after apply)
          + force_update_version   = (known after apply)
          + id                     = (known after apply)
          + instance_types         = (known after apply)
          + labels                 = (known after apply)
          + node_group_name        = (known after apply)
          + node_group_name_prefix = (known after apply)
          + node_role_arn          = (known after apply)
          + release_version        = (known after apply)
          + resources              = (known after apply)
          + status                 = (known after apply)
          + subnet_ids             = (known after apply)
          + tags                   = (known after apply)
          + tags_all               = (known after apply)
          + version                = (known after apply)
        } -> (known after apply)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
